aks_restrict_egress_cni_overlay/artillery/load-test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://<firewall ip>  
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 1000
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 5000
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 10000
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/"
        count: 100